//*****************************************************************************
// @(R)
//		アイドルタスク
//		
// @(X)
//
//  Copyright (c) Hitachi Power Solutions Co., Ltd. All rights reserved.
//******************************************************************************
//****** 変更履歴 **************************************************************
//ver 1.0	2025.11.10	初版作成
//******** ヘッダファイル参照宣言部 ********************************************
#include	"g_include_def.h"													//共通インクルードファイル
//******** ファイル内環境宣言部 ************************************************
//定義無し
//******** プロトタイプ宣言部 **************************************************
TASK idle_task(void);															//アイドルタスク
//******** 関数定義部 **********************************************************
TASK idle_task(void)
{
	UW count;																	//カウンタ
	
    Pout_s("IDLE_TASK_RUN");													//デバッグ情報
	Pout_LF();
	/* タスクループ */
	while (1) {																	//アイドルタスクよりも優先度の高い処理が無い場合
	
		count++;																//アイドル処理
		
	
	}
	
}