//******************************************************************************
// @(R)   
//		LAN初期化タスク
//		
// @(X)
//
//  Copyright (c) Hitachi Power Solutions Co., Ltd. All rights reserved.
//******************************************************************************
//******** 変更履歴 ************************************************************
//ver 1.0	2025.11.13	初版作成
//******** ヘッダファイル参照宣言部 ********************************************
#include	<machine.h>															//割込みレベル操作用
#include	"g_include_def.h"													//共通インクルードファイル
//******** ファイル内環境宣言部 ************************************************
//定義無し
//******** 定数定義部 **********************************************************
//定義無し
//******** 変数定義部 **********************************************************

//******** プロトタイプ宣言部 **************************************************
TASK lanini_task(void);				//LAN初期化タスク
ER soc_ini(void);					//ソケット通信初期化
void read_ip_addr(void);			//IPアドレス読み取り処理
ER read_ethernet_addr(void);		//MACアドレス読み取り処理
//******** 関数定義部 **********************************************************
TASK lanini_task(void)
{
	/* 変数定義 */
	ER ercd;
	
	ercd = soc_ini();						//ソケット通信初期化
	if (ercd != E_OK) {
		ext_tsk();							//エラー処理
	}
	
	sta_tsk(ID_LANCLI_UDP_TSK, 0);			//LANクライアントタスク起動
	sta_tsk(ID_LANCLI_TCP_TSK, 0);			//LANクライアントタスク起動

}
//******** 内部関数定義部 ******************************************************
//******************************************************************************
//  機能     : ソケット通信初期化
//  機能説明 : (1)IPアドレス設定
//           : (2)MACアドレス
//           : (3)プロトコルスタック初期化
//------------------------------------------------------------------------------
//  引数     : void
//------------------------------------------------------------------------------
//  戻り値   : E_OK(0以上)	:正常終了
//           : ER_NG(-1)	:異常終了(MACアドレス設定異常)
//           : その他		:異常終了
//******************************************************************************
ER soc_ini(void)
{
	ER ercd;

	read_ip_addr();							//IPアドレス設定

	ercd = read_ethernet_addr();			//MACアドレス設定
	
	if(ercd != ER_OK){return ER_NG;}		//MACアドレス設定異常
	
	ercd = tcp_ini();						//プロトコルスタック初期化
	
	return ercd;							//正常:E_OK、異常：その他
	
}
//******************************************************************************
//  機能     : IPアドレス等の読み取り処理
//  機能説明 : (1)自分側IPアドレスの設定
//           : (2)デフォルトゲートウェイの設定
//           : (3)サブネットマスクの設定
//           : (4)相手側IPアドレスの設定
//           : 第3,第4オクテットは西武用にDIPSWの値を反映
//------------------------------------------------------------------------------
//  引数     : void
//------------------------------------------------------------------------------
//  戻り値   : void
//******************************************************************************
void read_ip_addr(void)
{
	/* 自分側IPアドレスの設定 */
	*(default_ipaddr + 0) = OCT_IP_SRC_1;
	*(default_ipaddr + 1) = OCT_IP_SRC_2;
	*(default_ipaddr + 2) = OCT_IP_SRC_3;
	*(default_ipaddr + 3) = OCT_IP_SRC_4;
	
	/* デフォルトゲートウェイの設定 */
	*(default_gateway + 0) = OCT_DG_1;
	*(default_gateway + 1) = OCT_DG_2;
	*(default_gateway + 2) = OCT_DG_3;
	*(default_gateway + 3) = OCT_DG_4;
	
	/* サブネットマスクの設定 */
	*(subnet_mask + 0) = OCT_SM_1;
	*(subnet_mask + 1) = OCT_SM_2;
	*(subnet_mask + 2) = OCT_SM_3;
	*(subnet_mask + 3) = OCT_SM_4;
	
	/* 相手側IPアドレス(UDP/IP)の設定 */
	*(dst_ipaddr1 + 0) = OCT_IP_DST1_1;
	*(dst_ipaddr1 + 1) = OCT_IP_DST1_2;
	*(dst_ipaddr1 + 2) = OCT_IP_DST1_3;
	*(dst_ipaddr1 + 3) = OCT_IP_DST1_4;
	
	/* 相手側IPアドレス(TCP/IP)の設定 */
	*(dst_ipaddr2 + 0) = OCT_IP_DST2_1;
	*(dst_ipaddr2 + 1) = OCT_IP_DST2_2;
	*(dst_ipaddr2 + 2) = OCT_IP_DST2_3;
	*(dst_ipaddr2 + 3) = OCT_IP_DST2_4;
	
	
}
//******************************************************************************
//  機能     : MACアドレス取得処理
//  機能説明 : フラッシュメモリの規定位置の値をMACアドレスに設定
//------------------------------------------------------------------------------
//  引数     : void
//------------------------------------------------------------------------------
//  戻り値   : ER_OK( 0):正常終了(MACアドレス取得完了)
//           : ER_NG(-1):異常終了(MACアドレス取得異常)
//******************************************************************************
ER read_ethernet_addr(void)
{	
	/* 変数定義 */
	UB macaddr[6]={0};
	
	if(eep_mac_read(macaddr) == ER_OK){
	
		/* MACアドレス設定 */
		*(ethernet_addr + 0) = macaddr[0];		//第1オクテット
		*(ethernet_addr + 1) = macaddr[1];		//第2オクテット
		*(ethernet_addr + 2) = macaddr[2];		//第3オクテット
		*(ethernet_addr + 3) = macaddr[3];		//第4オクテット
		*(ethernet_addr + 4) = macaddr[4];		//第5オクテット
		*(ethernet_addr + 5) = macaddr[5];		//第6オクテット
		
		return ER_OK;							//正常終了
	
	}else{
		
		return ER_NG;							//異常終了
		
	}
	
}