//******************************************************************************
// @(R)
//		ModbusRTUタスク(Modbus通信用 通信対象：山洋製PCS)
//		
// @(X)
//
//  Copyright (c) Hitachi Power Solutions Co., Ltd. All rights reserved.
//******************************************************************************
//******** 変更履歴 ************************************************************
//ver 1.0	2025.11.14	初版作成
//******** ヘッダファイル参照宣言部 ********************************************
#include	<machine.h>															//割込みレベル操作用
#include	"g_include_def.h"													//共通インクルードファイル
//******** ファイル内環境宣言部 ************************************************
//定義無し
//******** 定数定義部 **********************************************************
#define UART_CH		2															//本タスクで使用するUARTチャンネルNo.(UART_CH=2)
#define SCI_TEND	SCI2.SSR.BIT.TEND											//送信終了フラグ(シリアルステータスレジスタ)
#define SEND_TIMOUT SCI2_SEND_TIMOUT											//送信待ち時間
#define SEND_ENABLE	SCI2_SEND_ENABLE											//送信許可(受信無効)
#define RECV_ENABLE	SCI2_RECV_ENABLE											//受信許可(送信無効)
//******** 変数定義部 **********************************************************

//******** プロトタイプ宣言部 **************************************************
TASK modbus_rtu_task(void);														//ModbusRTUタスク
//******** 関数定義部 **********************************************************
TASK modbus_rtu_task(void)
{
	/* 変数定義 */
	UINT status;						//イベントステータス
	
	/* タスクループ */
	while(1) {
		
		/* イベントフラグ待ち */
		WAI_FLG(ID_MODBUS_FLG, &status);
		
		/* Modbus状態要求イベント */
		if(status & F_MODBUS_REQ_EVENT){										//1000ms周期起動
			
			
		}
		
	}
}
//******** 内部関数定義部 ******************************************************
